{
    "categories": [
        {
            "name": "confirmed",
            "ideas": [
                {
                    "title": "Development of Roku Support",
                    "imageSrc": "roku.png",
                    "progress": 5,
                    "content": "As we move forward in the evolution of SNPad, our focus shifts toward expanding the accessibility of our platform by developing support for Roku devices. This step signifies our commitment to making the video advertising experience universally accessible, thereby enabling an even broader range of users to access our innovative services. Integrating with Roku, a market leader in streaming devices, will allow us to bring personalized ads and direct interactions into the living rooms of a significantly increased consumer base.<BR>Through this initiative, SNPad aims to provide an optimized solution for the distribution of advertising content on Roku devices, ensuring that users can enjoy ads tailored to their specific interests, right on their smart TVs. This includes the development of a dedicated app, easily installable from the Roku Store, which will enable users to swiftly and efficiently connect to their SNPad profiles.<BR>This extension will further solidify SNPad's presence in the digital ecosystem, offering advertisers the opportunity to reach a more diverse audience, while users will be rewarded for their interaction with ads through the allocation of SNP tokens. Moreover, the development of Roku support underscores our commitment to constantly innovate and improve the user experience, pushing the boundaries of what's possible in personalized digital advertising."
                },
                {
                    "title": "Development of SNP miner",
                    "imageSrc": "miner.jpeg",
                    "progress": 5,
                    "content":"In our continuous effort to innovate and enhance the functionality of the SNPad platform, we are excited to introduce the development of the SNP Miner. This unique component of our ecosystem represents a pivotal advancement in the decentralization of video advertising distribution. The SNP Miner is essentially a specialized device, built on the widely accessible and efficient Raspberry Pi board, which is outfitted with a Unix-based operating system and our proprietary mining software.<BR>The primary role of the SNP Miner is to host video files for the SNPad platform, enabling consumers to download these files directly from the miners using the WebRTC protocol. This peer-to-peer technology not only ensures a swift and reliable distribution of video content but also significantly reduces the bandwidth costs typically associated with traditional content delivery networks.<BR>Each SNP Miner operates as a node within the network, contributing to the decentralization and resilience of the platform. Miners are rewarded with SNP Tokens for each file downloaded by peers, creating an incentive mechanism that encourages the expansion of the network's capacity and availability. This reward system is designed to ensure that as the demand for SNPad's video advertising services grows, so too does the infrastructure supporting it, all without the need for centralized control or excessive overhead costs.<BR>The introduction of the SNP Miner is a testament to our commitment to leveraging cutting-edge technology to provide innovative solutions for video advertising. It not only offers a new way for participants to earn SNP Tokens but also enhances the overall efficiency and scalability of the SNPad platform. By embracing the principles of decentralization and peer-to-peer technology, we are setting a new standard in the advertising industry, making targeted and interactive video ads more accessible and enjoyable for consumers worldwide."
                },
                {
                    "title": "AI Template: Audio Synthesization",
                    "imageSrc": "audiosynth.jpeg",
                    "progress": 5,
                    "content": "In our ongoing quest to revolutionize the advertising landscape, we're introducing a groundbreaking AI Template for Audio Synthesization. This state-of-the-art feature is designed to significantly amplify the global reach and effectiveness of advertisements by breaking down language barriers in an innovative way. Advertisers, upon uploading an English ad audio file to our platform, can now effortlessly extend their message across diverse linguistic landscapes without losing the original's emotional depth or intonational nuance.<BR>At the heart of this AI template lies advanced machine learning algorithms capable of not just translating text, but also capturing and replicating the original speaker's intonation, pace, and emotional inflections in multiple languages. This sophisticated process begins with a deep neural network analysis of the original audio, identifying key tonal characteristics and emotional cues. Following this, our AI employs a combination of voice synthesis and natural language processing technologies to produce a translation that preserves the original ad's persuasive power and emotional resonance.<BR>The AI's ability to maintain the original ad's intonation across languages is pivotal. It ensures that the message's effectiveness is not diluted by the translation process, thereby maintaining the advertiser's intent and emotional connection with the audience, regardless of language. This feature is particularly beneficial for global campaigns where consistency in messaging and brand voice across different cultures and languages is crucial.<BR>Moreover, this AI-driven approach offers a scalable and cost-effective solution for creating multilingual advertising content. Traditionally, producing ads in multiple languages would require hiring voice actors for each language, a time-consuming and expensive process. Our AI Template for Audio Synthesization simplifies this, allowing for rapid scaling of advertising campaigns to multiple markets without incurring prohibitive costs or delays.<BR>In essence, the development of the AI Template for Audio Synthesization marks a significant leap forward in making personalized and emotionally resonant advertising more accessible on a global scale. By leveraging the latest advancements in AI and machine learning, we're not only enhancing the reach of advertisements but also ensuring that they maintain their impact and effectiveness, regardless of the audience's language."
                },
                {
                    "title": "Dynamic Ad Customization",
                    "imageSrc": "dynamicads.jpg",
                    "progress": 5,
                    "content": "Introducing a revolutionary feature in targeted advertising: Dynamic Chroma Key Ad Customization. This innovative solution offers advertisers unprecedented flexibility and personalization in video ad content creation. By utilizing chroma key technology—commonly known as green screen—we enable the automatic filling of specific ad areas with content tailored to each consumer's profile.<BR>Imagine a scenario where a major online retailer, like Walmart, creates a generic video advertisement with designated chroma key areas for a product, its price, and a brief description. Our cutting-edge technology takes over from here, dynamically identifying products that align with the consumer's preferences and interests, and seamlessly integrating this information into the video ad in real-time. The result? A highly personalized ad experience where every viewer sees a version of the ad that showcases products they're actually interested in, complete with up-to-date pricing and product details.<BR>This method not only enhances the relevance of ads for each viewer but also significantly increases the efficiency of ad campaigns. Advertisers can produce a single video template, which our system then customizes for individual viewers, saving time and resources while maximizing engagement and conversion rates. It's a game-changer for digital marketing, offering a level of ad personalization that was previously unimaginable. With Dynamic Chroma Key Ad Customization, we're transforming the way advertisers connect with their audience, making every ad view more meaningful and impactful."
                },
                {
                    "title": "Dynamic Ad Customization",
                    "imageSrc": "dynamicads.jpg",
                    "progress": 5,
                    "content": "Introducing a revolutionary feature in targeted advertising: Dynamic Chroma Key Ad Customization. This innovative solution offers advertisers unprecedented flexibility and personalization in video ad content creation. By utilizing chroma key technology—commonly known as green screen—we enable the automatic filling of specific ad areas with content tailored to each consumer's profile.<BR>Imagine a scenario where a major online retailer, like Walmart, creates a generic video advertisement with designated chroma key areas for a product, its price, and a brief description. Our cutting-edge technology takes over from here, dynamically identifying products that align with the consumer's preferences and interests, and seamlessly integrating this information into the video ad in real-time. The result? A highly personalized ad experience where every viewer sees a version of the ad that showcases products they're actually interested in, complete with up-to-date pricing and product details.<BR>This method not only enhances the relevance of ads for each viewer but also significantly increases the efficiency of ad campaigns. Advertisers can produce a single video template, which our system then customizes for individual viewers, saving time and resources while maximizing engagement and conversion rates. It's a game-changer for digital marketing, offering a level of ad personalization that was previously unimaginable. With Dynamic Chroma Key Ad Customization, we're transforming the way advertisers connect with their audience, making every ad view more meaningful and impactful."
                },
                {
                    "title": "Dynamic Ad Customization",
                    "imageSrc": "dynamicads.jpg",
                    "progress": 5,
                    "content": "Introducing a revolutionary feature in targeted advertising: Dynamic Chroma Key Ad Customization. This innovative solution offers advertisers unprecedented flexibility and personalization in video ad content creation. By utilizing chroma key technology—commonly known as green screen—we enable the automatic filling of specific ad areas with content tailored to each consumer's profile.<BR>Imagine a scenario where a major online retailer, like Walmart, creates a generic video advertisement with designated chroma key areas for a product, its price, and a brief description. Our cutting-edge technology takes over from here, dynamically identifying products that align with the consumer's preferences and interests, and seamlessly integrating this information into the video ad in real-time. The result? A highly personalized ad experience where every viewer sees a version of the ad that showcases products they're actually interested in, complete with up-to-date pricing and product details.<BR>This method not only enhances the relevance of ads for each viewer but also significantly increases the efficiency of ad campaigns. Advertisers can produce a single video template, which our system then customizes for individual viewers, saving time and resources while maximizing engagement and conversion rates. It's a game-changer for digital marketing, offering a level of ad personalization that was previously unimaginable. With Dynamic Chroma Key Ad Customization, we're transforming the way advertisers connect with their audience, making every ad view more meaningful and impactful."
                },
                {
                    "title": "Dynamic Ad Customization",
                    "imageSrc": "dynamicads.jpg",
                    "progress": 5,
                    "content": "Introducing a revolutionary feature in targeted advertising: Dynamic Chroma Key Ad Customization. This innovative solution offers advertisers unprecedented flexibility and personalization in video ad content creation. By utilizing chroma key technology—commonly known as green screen—we enable the automatic filling of specific ad areas with content tailored to each consumer's profile.<BR>Imagine a scenario where a major online retailer, like Walmart, creates a generic video advertisement with designated chroma key areas for a product, its price, and a brief description. Our cutting-edge technology takes over from here, dynamically identifying products that align with the consumer's preferences and interests, and seamlessly integrating this information into the video ad in real-time. The result? A highly personalized ad experience where every viewer sees a version of the ad that showcases products they're actually interested in, complete with up-to-date pricing and product details.<BR>This method not only enhances the relevance of ads for each viewer but also significantly increases the efficiency of ad campaigns. Advertisers can produce a single video template, which our system then customizes for individual viewers, saving time and resources while maximizing engagement and conversion rates. It's a game-changer for digital marketing, offering a level of ad personalization that was previously unimaginable. With Dynamic Chroma Key Ad Customization, we're transforming the way advertisers connect with their audience, making every ad view more meaningful and impactful."
                },
                {
                    "title": "Dynamic Ad Customization",
                    "imageSrc": "dynamicads.jpg",
                    "progress": 5,
                    "content": "Introducing a revolutionary feature in targeted advertising: Dynamic Chroma Key Ad Customization. This innovative solution offers advertisers unprecedented flexibility and personalization in video ad content creation. By utilizing chroma key technology—commonly known as green screen—we enable the automatic filling of specific ad areas with content tailored to each consumer's profile.<BR>Imagine a scenario where a major online retailer, like Walmart, creates a generic video advertisement with designated chroma key areas for a product, its price, and a brief description. Our cutting-edge technology takes over from here, dynamically identifying products that align with the consumer's preferences and interests, and seamlessly integrating this information into the video ad in real-time. The result? A highly personalized ad experience where every viewer sees a version of the ad that showcases products they're actually interested in, complete with up-to-date pricing and product details.<BR>This method not only enhances the relevance of ads for each viewer but also significantly increases the efficiency of ad campaigns. Advertisers can produce a single video template, which our system then customizes for individual viewers, saving time and resources while maximizing engagement and conversion rates. It's a game-changer for digital marketing, offering a level of ad personalization that was previously unimaginable. With Dynamic Chroma Key Ad Customization, we're transforming the way advertisers connect with their audience, making every ad view more meaningful and impactful."
                }

            ]
        },
        {
            "name": "doing",
            "ideas": [
                {
                    "title": "SNPad app: TV Samsung",
                    "imageSrc": "samsung.jpg",
                    "progress": 80,
                    "content": "The SNPad app for Samsung TVs is designed with the consumer experience at its core. It allows Samsung Smart TV owners to effortlessly download and install our application directly from the Samsung TV App Store, providing instant access to personalized, interactive advertising content. Through the app, users can seamlessly link their mobile profiles, ensuring that the ads displayed on their TV are tailored to their interests, preferences, and behaviors, as outlined in their SNPad mobile app profile.<BR>This integration offers a dual benefit. For consumers, it means receiving ads that are relevant, engaging, and potentially more valuable to their lifestyle choices. They can interact with these ads using their TV remote, engaging with features like extended product information, QR code activations for special offers, and even direct purchasing options for products and services.<BR>For advertisers, the launch of the SNPad app on Samsung TVs represents an opportunity to engage with a highly targeted audience in a cutting-edge, interactive format. Advertisers can now leverage the detailed consumer profiles collected via the SNPad mobile app to deliver ads that are not only more likely to resonate with viewers but also capable of driving higher conversion rates due to their personalized nature.<BR>The introduction of the SNPad app on Samsung Smart TVs is a testament to our dedication to pushing the boundaries of advertising technology. By harnessing the power of smart TV platforms, we are not just reaching viewers in their living rooms; we are creating a more engaging, interactive, and rewarding advertising experience that benefits both consumers and advertisers alike."
                },
                {
                    "title": "Idea 2 Doing",
                    "imageSrc": "dummy1.png",
                    "progress": 50,
                    "content": "Vestibulum eget tincidunt justo, nec condimentum lectus. Nullam malesuada nunc id velit congue, vel efficitur leo dictum. Proin malesuada augue sit amet felis pharetra, nec venenatis est convallis. In hac habitasse platea dictumst. Integer ac tortor sit amet sem congue varius. Fusce vestibulum magna vel tortor scelerisque, id facilisis libero fermentum. Vivamus convallis, justo non faucibus accumsan, elit ipsum hendrerit quam, id fermentum elit nulla eget justo. Nullam posuere, justo a malesuada pellentesque, lectus urna congue est, vel tempor libero nisl id odio. Nulla facilisi."
                },
                {
                    "title": "Idea 3 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                }
            ]
        },
        {
            "name": "done",
            "ideas": [
                {
                    "title": "Idea 1 Done",
                    "imageSrc": "dummy2.png",
                    "progress": 25,
                    "content": "Fusce non nunc at turpis mollis sollicitudin. Ut quis mauris ut tellus rutrum aliquet. Maecenas finibus at odio ut pellentesque. Sed eget magna eget eros interdum convallis. Suspendisse potenti. Nullam vestibulum massa a semper pretium. Fusce gravida scelerisque ex, a tempus purus pulvinar eu. Curabitur pharetra est a felis egestas blandit. Nulla facilisi. Sed vel orci felis. Cras nec dictum dolor, id dignissim nunc. Integer non lorem id urna venenatis lobortis."
                },
                {
                    "title": "Idea 2 Done",
                    "imageSrc": "dummy4.png",
                    "progress": 50,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Mauris suscipit, purus ac interdum dictum, libero purus tristique enim, a hendrerit quam odio et nulla. Sed vel gravida velit. Sed venenatis accumsan erat sit amet euismod. Quisque et justo nec ipsum lacinia faucibus. Aliquam mattis ex vel odio volutpat, vitae volutpat orci facilisis. Ut nec ligula sed augue vehicula dapibus. Integer pharetra leo sit amet est consectetur, eget convallis turpis posuere. In hac habitasse platea dictumst. Curabitur euismod ipsum eget vestibulum feugiat. Aliquam erat volutpat. Maecenas faucibus metus nec risus venenatis, eget accumsan risus convallis. Fusce luctus erat a nibh ultrices, vel varius quam lobortis. Cras ac leo ut nisl dapibus rhoncus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas."
                },
                {
                    "title": "Idea 3 Done",
                    "imageSrc": "dummy3.png",
                    "progress": 75,
                    "content": "Maecenas eget sapien felis. In eleifend tincidunt nisi, vel auctor risus dictum vel. Duis luctus mauris id tellus placerat pharetra. Ut convallis auctor orci, a hendrerit risus facilisis vel. Phasellus auctor eros ligula, non consectetur lorem efficitur eu. Donec sit amet dui sem. Morbi congue est nec mi maximus, non lobortis nisl tempor. Phasellus efficitur lacinia metus, at cursus velit blandit nec. Pellentesque in commodo ante. Aliquam luctus euismod vehicula. Duis ut ex id elit elementum interdum eget eget velit."
                },
                {
                    "title": "Idea 4 Done",
                    "imageSrc": "dummy3.png",
                    "progress": 73,
                    "content": "Maecenas eget sapien felis. In eleifend tincidunt nisi, vel auctor risus dictum vel. Duis luctus mauris id tellus placerat pharetra. Ut convallis auctor orci, a hendrerit risus facilisis vel. Phasellus auctor eros ligula, non consectetur lorem efficitur eu. Donec sit amet dui sem. Morbi congue est nec mi maximus, non lobortis nisl tempor. Phasellus efficitur lacinia metus, at cursus velit blandit nec. Pellentesque in commodo ante. Aliquam luctus euismod vehicula. Duis ut ex id elit elementum interdum eget eget velit."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },
                {
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                },{
                    "title": "Idea 4 Doing",
                    "imageSrc": "dummy4.png",
                    "progress": 75,
                    "content": "Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut a aliquam nisl. Duis accumsan odio in dui ultricies, nec sollicitudin lectus laoreet. Maecenas dapibus magna at purus dignissim hendrerit. Nunc aliquet hendrerit ex, a dapibus nulla elementum in. Vivamus nec vehicula nisl, id fringilla mi. Quisque commodo urna eget nisi pharetra, quis dapibus nisi varius. Integer faucibus laoreet convallis. Mauris in lorem nec nibh fermentum pulvinar eget nec orci. In ullamcorper risus eu nulla fermentum, id mattis metus bibendum."
                }
            ]
        }
    ]
}
